load-testing/script.yml
config:
  target: 'http://service1.acme.corp:3003'
  phases:
    - duration: 1
      arrivalRate: 1
  environments:
    development:
      target: '{{ $env.API_URL }}'
      phases:
        - duration: 300
          arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: '/dev/v1/health'
          json:
            checks:
              database: true
          # headers:
          #   x-api-key: '{{ $env.SERVICE_API_KEY }}'